Console.Clear();
Console.WriteLine($"Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.");

Console.Write("\nВведите кол-во элементов массива: ");
int massive = Convert.ToInt32(Console.ReadLine());
string[] array = new string[massive];

FillArray(array);
PrintArray(CheckArray(array));

//-----------------------------------------------------------------------------------------------------------------------------------------------------

void FillArray(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"Введите {i + 1} элемент массива: ");
        array[i] = Console.ReadLine();
    }
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------

string[] CheckArray(string[] array)
{
    int a = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3) a++;
    }
    string[] temp = new string[a];
    int j = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i].Length <= 3)
        {
            temp[j] = array[i];
            j++;
        }
    }
    return temp;
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------

void PrintArray(string[] array)
{
    Console.Write($"\nРезультат: [");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($" '{array[i]}' ");
    }
    Console.Write("]");
}

//-----------------------------------------------------------------------------------------------------------------------------------------------------